public class Consultation_20_02_23 {
    public static void main(String[] args) {
        /*
Задача 1 (ToDoList)

Написать метод

public static void addRecord(List<String> records) {
  System.out.println("Добавляем запись\n"); // отладочный вывод
}

Метод должен прочитать строку и добавить её в конец списка records.

         */
    }
}
