import java.util.Scanner;

public class Homework7 {
    //Написать программу, выводящую на экран ASCII значение символа
    //(например если символ Z то должно быть напечатано 90)
    public static void main(String[] args) {
        char a = '$';
        int ascii = (int) a;
        System.out.println("$ is in ASCII " + ascii);
//int ascii = '$';
    }
}
